analysis/dbbenchResults/old/long/WriteHeavyLeveled15.txt
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       8 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    1000000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    984191.9 MB (estimated)
FileSize:   495910.6 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: skip_list
Perf Level: 1
------------------------------------------------
DB path: [/mnt/c/temp/rocksdbtest-1000/dbbench]
readrandomwriterandom :     167.970 micros/op 23789 ops/sec; ( reads:1784500 writes:1784499 total:1000000000 found:6417)
Microseconds per read:
Count: 7158000 Average: 265.2008  StdDev: 305.48
Min: 4  Median: 137.8685  Max: 2186880
Percentiles: P50: 137.87 P75: 184.96 P99: 470.58 P99.9: 24368.79 P99.99: 325894.74
------------------------------------------------------
(       3,       4 ]      377   0.005%   0.005% 
(       4,       6 ]   120081   1.678%   1.683% 
(       6,      10 ]    95461   1.334%   3.016% 
(      10,      15 ]    13997   0.196%   3.212% 
(      15,      22 ]     3434   0.048%   3.260% 
(      22,      34 ]    50529   0.706%   3.966% 
(      34,      51 ]   155110   2.167%   6.133% 
(      51,      76 ]   527019   7.363%  13.496% #
(      76,     110 ]  1335353  18.655%  32.151% ####
(     110,     170 ]  2750715  38.429%  70.579% ########
(     170,     250 ]  1691998  23.638%  94.217% #####
(     250,     380 ]   323392   4.518%  98.735% #
(     380,     580 ]    41850   0.585%  99.320% 
(     580,     870 ]    12342   0.172%  99.492% 
(     870,    1300 ]     5172   0.072%  99.565% 
(    1300,    1900 ]     3716   0.052%  99.616% 
(    1900,    2900 ]     3634   0.051%  99.667% 
(    2900,    4400 ]     5136   0.072%  99.739% 
(    4400,    6600 ]     6973   0.097%  99.836% 
(    6600,    9900 ]     1582   0.022%  99.858% 
(    9900,   14000 ]     1018   0.014%  99.873% 
(   14000,   22000 ]      791   0.011%  99.884% 
(   22000,   33000 ]     5396   0.075%  99.959% 
(   33000,   50000 ]      589   0.008%  99.967% 
(   50000,   75000 ]      824   0.012%  99.979% 
(   75000,  110000 ]      210   0.003%  99.982% 
(  110000,  170000 ]      270   0.004%  99.986% 
(  170000,  250000 ]      171   0.002%  99.988% 
(  250000,  380000 ]      247   0.003%  99.991% 
(  380000,  570000 ]      299   0.004%  99.996% 
(  570000,  860000 ]      267   0.004%  99.999% 
(  860000, 1200000 ]       30   0.000% 100.000% 
( 1200000, 1900000 ]       15   0.000% 100.000% 
( 1900000, 2900000 ]        2   0.000% 100.000% 

Microseconds per write:
Count: 7157996 Average: 70.7387  StdDev: 400.18
Min: 11  Median: 15.9914  Max: 11201668
Percentiles: P50: 15.99 P75: 20.25 P99: 42.84 P99.9: 94.22 P99.99: 213.44
------------------------------------------------------
(      10,      15 ]  3162717  44.184%  44.184% #########
(      15,      22 ]  2939310  41.063%  85.248% ########
(      22,      34 ]   937593  13.099%  98.346% ###
(      34,      51 ]    89966   1.257%  99.603% 
(      51,      76 ]    15151   0.212%  99.815% 
(      76,     110 ]    11382   0.159%  99.974% 
(     110,     170 ]     1045   0.015%  99.988% 
(     170,     250 ]      214   0.003%  99.991% 
(     250,     380 ]       24   0.000%  99.992% 
(     380,     580 ]       56   0.001%  99.992% 
(     580,     870 ]       31   0.000%  99.993% 
(     870,    1300 ]       15   0.000%  99.993% 
(    1300,    1900 ]        9   0.000%  99.993% 
(    1900,    2900 ]      113   0.002%  99.995% 
(    2900,    4400 ]       24   0.000%  99.995% 
(    4400,    6600 ]        7   0.000%  99.995% 
(    6600,    9900 ]        9   0.000%  99.995% 
(    9900,   14000 ]        7   0.000%  99.995% 
(   14000,   22000 ]        5   0.000%  99.996% 
(   22000,   33000 ]       33   0.000%  99.996% 
(   33000,   50000 ]       50   0.001%  99.997% 
(   50000,   75000 ]      147   0.002%  99.999% 
(   75000,  110000 ]       22   0.000%  99.999% 
(  110000,  170000 ]        1   0.000%  99.999% 
(  170000,  250000 ]        4   0.000%  99.999% 
(  380000,  570000 ]        1   0.000%  99.999% 
( 1200000, 1900000 ]        4   0.000%  99.999% 
( 1900000, 2900000 ]        8   0.000%  99.999% 
( 2900000, 4300000 ]        8   0.000%  99.999% 
( 4300000, 6500000 ]       12   0.000% 100.000% 
( 6500000, 9800000 ]       20   0.000% 100.000% 
( 9800000, 14000000 ]        8   0.000% 100.000% 



** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      1/0   121.89 MB   0.5      3.9     0.0      3.9      10.8      6.9       0.0   1.6      9.0     24.9    445.51             33.36        65    6.854   4026K    973       0.0       0.0
  L1     17/1   989.30 MB   3.6     10.8     6.8      4.1      10.8      6.8       0.0   1.6     38.1     38.1    291.19             59.88         9   32.355     11M   6383       0.0       0.0
  L2     52/1    3.17 GB   1.2     11.1     4.7      6.3      11.0      4.7       1.1   2.3     17.5     17.5    645.72             57.30        67    9.638     11M   7855       0.0       0.0
  L3     42/0    2.63 GB   0.1      0.0     0.0      0.0       0.0      0.0       2.6   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
 Sum    112/2    6.89 GB   0.0     25.8    11.5     14.3      32.7     18.4       3.7   4.7     19.1     24.2   1382.42            150.53       141    9.804     26M    15K       0.0       0.0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     25.8    11.5     14.3      25.8     11.5       0.0   0.0     23.6     23.5   1122.09            139.19        83   13.519     26M    15K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       6.9      6.9       0.0   0.0      0.0     27.2    260.33             11.34        58    4.488       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB

Uptime(secs): 601.8 total, 1.8 interval
Flush(GB): cumulative 6.904, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 32.70 GB write, 55.65 MB/s write, 25.82 GB read, 43.93 MB/s read, 1382.4 seconds
Interval compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 15 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **
** Level 0 read latency histogram (micros):
Count: 41360917 Average: 11.8494  StdDev: 48.22
Min: 4  Median: 8.9290  Max: 1561264
Percentiles: P50: 8.93 P75: 12.73 P99: 41.32 P99.9: 70.21 P99.99: 83.17
------------------------------------------------------
(       3,       4 ]        5   0.000%   0.000% 
(       4,       6 ]  1295807   3.133%   3.133% #
(       6,      10 ] 26472874  64.005%  67.138% #############
(      10,      15 ]  5947630  14.380%  81.517% ###
(      15,      22 ]  4818275  11.649%  93.167% ##
(      22,      34 ]  2213141   5.351%  98.517% #
(      34,      51 ]   463185   1.120%  99.637% 
(      51,      76 ]   141375   0.342%  99.979% 
(      76,     110 ]    21278   0.051% 100.031% 
(     110,     170 ]     5960   0.014% 100.045% 
(     170,     250 ]      322   0.001% 100.046% 
(     250,     380 ]      117   0.000% 100.046% 
(     380,     580 ]       55   0.000% 100.046% 
(     580,     870 ]       40   0.000% 100.046% 
(     870,    1300 ]       53   0.000% 100.046% 
(    1300,    1900 ]       48   0.000% 100.047% 
(    1900,    2900 ]      723   0.002% 100.048% 
(    2900,    4400 ]       69   0.000% 100.048% 
(    4400,    6600 ]       17   0.000% 100.048% 
(    6600,    9900 ]        4   0.000% 100.049% 
(    9900,   14000 ]        3   0.000% 100.049% 
(   50000,   75000 ]        5   0.000% 100.049% 
(   75000,  110000 ]        4   0.000% 100.049% 
(  110000,  170000 ]        4   0.000% 100.049% 
(  250000,  380000 ]        3   0.000% 100.049% 
(  380000,  570000 ]        2   0.000% 100.049% 
( 1200000, 1900000 ]        2   0.000% 100.049% 

** Level 1 read latency histogram (micros):
Count: 8219692 Average: 23.7682  StdDev: 250.58
Min: 4  Median: 8.1732  Max: 1561270
Percentiles: P50: 8.17 P75: 9.81 P99: 33.64 P99.9: 353.45 P99.99: 2812.64
------------------------------------------------------
(       3,       4 ]       34   0.000%   0.000% 
(       4,       6 ]  1387692  16.883%  16.883% ###
(       6,      10 ]  5010284  60.955%  77.838% ############
(      10,      15 ]   970313  11.805%  89.642% ##
(      15,      22 ]   531415   6.465%  96.107% #
(      22,      34 ]   245189   2.983%  99.090% #
(      34,      51 ]    45956   0.559%  99.650% 
(      51,      76 ]    11819   0.144%  99.793% 
(      76,     110 ]     1884   0.023%  99.816% 
(     110,     170 ]     1047   0.013%  99.829% 
(     170,     250 ]     2439   0.030%  99.859% 
(     250,     380 ]     4273   0.052%  99.911% 
(     380,     580 ]     2312   0.028%  99.939% 
(     580,     870 ]     1573   0.019%  99.958% 
(     870,    1300 ]     1085   0.013%  99.971% 
(    1300,    1900 ]      939   0.011%  99.983% 
(    1900,    2900 ]      675   0.008%  99.991% 
(    2900,    4400 ]      314   0.004%  99.995% 
(    4400,    6600 ]      558   0.007% 100.001% 
(    6600,    9900 ]       62   0.001% 100.002% 
(    9900,   14000 ]       56   0.001% 100.003% 
(   14000,   22000 ]       39   0.000% 100.003% 
(   22000,   33000 ]      235   0.003% 100.006% 
(   33000,   50000 ]       28   0.000% 100.006% 
(   50000,   75000 ]       73   0.001% 100.007% 
(   75000,  110000 ]       23   0.000% 100.008% 
(  110000,  170000 ]       45   0.001% 100.008% 
(  170000,  250000 ]       32   0.000% 100.009% 
(  250000,  380000 ]       45   0.001% 100.009% 
(  380000,  570000 ]       43   0.001% 100.010% 
(  570000,  860000 ]       52   0.001% 100.010% 
(  860000, 1200000 ]        1   0.000% 100.010% 
( 1200000, 1900000 ]        2   0.000% 100.010% 

** Level 2 read latency histogram (micros):
Count: 6782271 Average: 141.7994  StdDev: 342.53
Min: 4  Median: 8.3253  Max: 1769614
Percentiles: P50: 8.33 P75: 10.04 P99: 308.93 P99.9: 23385.02 P99.99: 72004.41
------------------------------------------------------
(       3,       4 ]       23   0.000%   0.000% 
(       4,       6 ]  1045948  15.422%  15.422% ###
(       6,      10 ]  4034137  59.481%  74.903% ############
(      10,      15 ]   823375  12.140%  87.043% ##
(      15,      22 ]   472555   6.968%  94.010% #
(      22,      34 ]   235264   3.469%  97.479% #
(      34,      51 ]    45468   0.670%  98.150% 
(      51,      76 ]     9341   0.138%  98.287% 
(      76,     110 ]     2395   0.035%  98.323% 
(     110,     170 ]     6087   0.090%  98.412% 
(     170,     250 ]    26843   0.396%  98.808% 
(     250,     380 ]    28707   0.423%  99.231% 
(     380,     580 ]    13605   0.201%  99.432% 
(     580,     870 ]     6679   0.098%  99.530% 
(     870,    1300 ]     3858   0.057%  99.587% 
(    1300,    1900 ]     3314   0.049%  99.636% 
(    1900,    2900 ]     2926   0.043%  99.679% 
(    2900,    4400 ]     4902   0.072%  99.752% 
(    4400,    6600 ]     6398   0.094%  99.846% 
(    6600,    9900 ]     1399   0.021%  99.867% 
(    9900,   14000 ]      801   0.012%  99.878% 
(   14000,   22000 ]      758   0.011%  99.890% 
(   22000,   33000 ]     5605   0.083%  99.972% 
(   33000,   50000 ]      542   0.008%  99.980% 
(   50000,   75000 ]      753   0.011%  99.991% 
(   75000,  110000 ]      202   0.003%  99.994% 
(  110000,  170000 ]      272   0.004%  99.998% 
(  170000,  250000 ]      169   0.002% 100.001% 
(  250000,  380000 ]      259   0.004% 100.005% 
(  380000,  570000 ]      345   0.005% 100.010% 
(  570000,  860000 ]      278   0.004% 100.014% 
(  860000, 1200000 ]       11   0.000% 100.014% 
( 1200000, 1900000 ]        6   0.000% 100.014% 


** DB Stats **
Uptime(secs): 601.8 total, 1.8 interval
Cumulative writes: 7157K writes, 7157K keys, 6893K commit groups, 1.0 writes per commit group, ingest: 6.98 GB, 11.88 MB/s
Cumulative WAL: 7157K writes, 0 syncs, 7157996.00 writes per sync, written: 6.98 GB, 11.88 MB/s
Cumulative stall: 00:01:29.959 H:M:S, 14.9 percent
Interval writes: 746 writes, 746 keys, 746 commit groups, 1.0 writes per commit group, ingest: 0.75 MB, 0.42 MB/s
Interval WAL: 746 writes, 0 syncs, 746.00 writes per sync, written: 0.00 MB, 0.42 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent

STATISTICS:
rocksdb.block.cache.miss COUNT : 56398549
rocksdb.block.cache.hit COUNT : 409897
rocksdb.block.cache.add COUNT : 49783035
rocksdb.block.cache.add.failures COUNT : 0
rocksdb.block.cache.index.miss COUNT : 0
rocksdb.block.cache.index.hit COUNT : 0
rocksdb.block.cache.index.add COUNT : 0
rocksdb.block.cache.index.bytes.insert COUNT : 0
rocksdb.block.cache.index.bytes.evict COUNT : 0
rocksdb.block.cache.filter.miss COUNT : 0
rocksdb.block.cache.filter.hit COUNT : 0
rocksdb.block.cache.filter.add COUNT : 0
rocksdb.block.cache.filter.bytes.insert COUNT : 0
rocksdb.block.cache.filter.bytes.evict COUNT : 0
rocksdb.block.cache.data.miss COUNT : 56398549
rocksdb.block.cache.data.hit COUNT : 409897
rocksdb.block.cache.data.add COUNT : 49783035
rocksdb.block.cache.data.bytes.insert COUNT : 211880909936
rocksdb.block.cache.bytes.read COUNT : 1744563328
rocksdb.block.cache.bytes.write COUNT : 211880909936
rocksdb.bloom.filter.useful COUNT : 0
rocksdb.bloom.filter.full.positive COUNT : 0
rocksdb.bloom.filter.full.true.positive COUNT : 0
rocksdb.bloom.filter.micros COUNT : 0
rocksdb.persistent.cache.hit COUNT : 0
rocksdb.persistent.cache.miss COUNT : 0
rocksdb.sim.block.cache.hit COUNT : 0
rocksdb.sim.block.cache.miss COUNT : 0
rocksdb.memtable.hit COUNT : 872
rocksdb.memtable.miss COUNT : 7157128
rocksdb.l0.hit COUNT : 7123
rocksdb.l1.hit COUNT : 5329
rocksdb.l2andup.hit COUNT : 12150
rocksdb.compaction.key.drop.new COUNT : 15290
rocksdb.compaction.key.drop.obsolete COUNT : 0
rocksdb.compaction.key.drop.range_del COUNT : 0
rocksdb.compaction.key.drop.user COUNT : 0
rocksdb.compaction.range_del.drop.obsolete COUNT : 0
rocksdb.compaction.optimized.del.drop.obsolete COUNT : 0
rocksdb.compaction.cancelled COUNT : 0
rocksdb.number.keys.written COUNT : 7157996
rocksdb.number.keys.read COUNT : 7158000
rocksdb.number.keys.updated COUNT : 0
rocksdb.bytes.written COUNT : 7498409468
rocksdb.bytes.read COUNT : 26085376
rocksdb.number.db.seek COUNT : 0
rocksdb.number.db.next COUNT : 0
rocksdb.number.db.prev COUNT : 0
rocksdb.number.db.seek.found COUNT : 0
rocksdb.number.db.next.found COUNT : 0
rocksdb.number.db.prev.found COUNT : 0
rocksdb.db.iter.bytes.read COUNT : 0
rocksdb.no.file.closes COUNT : 0
rocksdb.no.file.opens COUNT : 423
rocksdb.no.file.errors COUNT : 0
rocksdb.l0.slowdown.micros COUNT : 0
rocksdb.memtable.compaction.micros COUNT : 0
rocksdb.l0.num.files.stall.micros COUNT : 0
rocksdb.stall.micros COUNT : 89958918
rocksdb.db.mutex.wait.micros COUNT : 0
rocksdb.rate.limit.delay.millis COUNT : 0
rocksdb.num.iterators COUNT : 0
rocksdb.number.multiget.get COUNT : 0
rocksdb.number.multiget.keys.read COUNT : 0
rocksdb.number.multiget.bytes.read COUNT : 0
rocksdb.number.deletes.filtered COUNT : 0
rocksdb.number.merge.failures COUNT : 0
rocksdb.bloom.filter.prefix.checked COUNT : 0
rocksdb.bloom.filter.prefix.useful COUNT : 0
rocksdb.number.reseeks.iteration COUNT : 0
rocksdb.getupdatessince.calls COUNT : 0
rocksdb.block.cachecompressed.miss COUNT : 0
rocksdb.block.cachecompressed.hit COUNT : 0
rocksdb.block.cachecompressed.add COUNT : 0
rocksdb.block.cachecompressed.add.failures COUNT : 0
rocksdb.wal.synced COUNT : 0
rocksdb.wal.bytes COUNT : 7498409468
rocksdb.write.self COUNT : 6893801
rocksdb.write.other COUNT : 264195
rocksdb.write.timeout COUNT : 0
rocksdb.write.wal COUNT : 7157996
rocksdb.compact.read.bytes COUNT : 27717793279
rocksdb.compact.write.bytes COUNT : 27781449508
rocksdb.flush.write.bytes COUNT : 7413236608
rocksdb.compact.read.marked.bytes COUNT : 0
rocksdb.compact.read.periodic.bytes COUNT : 0
rocksdb.compact.read.ttl.bytes COUNT : 0
rocksdb.compact.write.marked.bytes COUNT : 0
rocksdb.compact.write.periodic.bytes COUNT : 0
rocksdb.compact.write.ttl.bytes COUNT : 0
rocksdb.number.direct.load.table.properties COUNT : 0
rocksdb.number.superversion_acquires COUNT : 902
rocksdb.number.superversion_releases COUNT : 676
rocksdb.number.superversion_cleanups COUNT : 211
rocksdb.number.block.compressed COUNT : 0
rocksdb.number.block.decompressed COUNT : 0
rocksdb.number.block.not_compressed COUNT : 0
rocksdb.merge.operation.time.nanos COUNT : 0
rocksdb.filter.operation.time.nanos COUNT : 0
rocksdb.row.cache.hit COUNT : 0
rocksdb.row.cache.miss COUNT : 0
rocksdb.read.amp.estimate.useful.bytes COUNT : 0
rocksdb.read.amp.total.read.bytes COUNT : 0
rocksdb.number.rate_limiter.drains COUNT : 0
rocksdb.number.iter.skip COUNT : 0
rocksdb.blobdb.num.put COUNT : 0
rocksdb.blobdb.num.write COUNT : 0
rocksdb.blobdb.num.get COUNT : 0
rocksdb.blobdb.num.multiget COUNT : 0
rocksdb.blobdb.num.seek COUNT : 0
rocksdb.blobdb.num.next COUNT : 0
rocksdb.blobdb.num.prev COUNT : 0
rocksdb.blobdb.num.keys.written COUNT : 0
rocksdb.blobdb.num.keys.read COUNT : 0
rocksdb.blobdb.bytes.written COUNT : 0
rocksdb.blobdb.bytes.read COUNT : 0
rocksdb.blobdb.write.inlined COUNT : 0
rocksdb.blobdb.write.inlined.ttl COUNT : 0
rocksdb.blobdb.write.blob COUNT : 0
rocksdb.blobdb.write.blob.ttl COUNT : 0
rocksdb.blobdb.blob.file.bytes.written COUNT : 0
rocksdb.blobdb.blob.file.bytes.read COUNT : 0
rocksdb.blobdb.blob.file.synced COUNT : 0
rocksdb.blobdb.blob.index.expired.count COUNT : 0
rocksdb.blobdb.blob.index.expired.size COUNT : 0
rocksdb.blobdb.blob.index.evicted.count COUNT : 0
rocksdb.blobdb.blob.index.evicted.size COUNT : 0
rocksdb.blobdb.gc.num.files COUNT : 0
rocksdb.blobdb.gc.num.new.files COUNT : 0
rocksdb.blobdb.gc.failures COUNT : 0
rocksdb.blobdb.gc.num.keys.overwritten COUNT : 0
rocksdb.blobdb.gc.num.keys.expired COUNT : 0
rocksdb.blobdb.gc.num.keys.relocated COUNT : 0
rocksdb.blobdb.gc.bytes.overwritten COUNT : 0
rocksdb.blobdb.gc.bytes.expired COUNT : 0
rocksdb.blobdb.gc.bytes.relocated COUNT : 0
rocksdb.blobdb.fifo.num.files.evicted COUNT : 0
rocksdb.blobdb.fifo.num.keys.evicted COUNT : 0
rocksdb.blobdb.fifo.bytes.evicted COUNT : 0
rocksdb.txn.overhead.mutex.prepare COUNT : 0
rocksdb.txn.overhead.mutex.old.commit.map COUNT : 0
rocksdb.txn.overhead.duplicate.key COUNT : 0
rocksdb.txn.overhead.mutex.snapshot COUNT : 0
rocksdb.txn.get.tryagain COUNT : 0
rocksdb.number.multiget.keys.found COUNT : 0
rocksdb.num.iterator.created COUNT : 0
rocksdb.num.iterator.deleted COUNT : 0
rocksdb.block.cache.compression.dict.miss COUNT : 0
rocksdb.block.cache.compression.dict.hit COUNT : 0
rocksdb.block.cache.compression.dict.add COUNT : 0
rocksdb.block.cache.compression.dict.bytes.insert COUNT : 0
rocksdb.block.cache.compression.dict.bytes.evict COUNT : 0
rocksdb.block.cache.add.redundant COUNT : 1040
rocksdb.block.cache.index.add.redundant COUNT : 0
rocksdb.block.cache.filter.add.redundant COUNT : 0
rocksdb.block.cache.data.add.redundant COUNT : 1040
rocksdb.block.cache.compression.dict.add.redundant COUNT : 0
rocksdb.files.marked.trash COUNT : 0
rocksdb.files.deleted.immediately COUNT : 369
rocksdb.error.handler.bg.errro.count COUNT : 0
rocksdb.error.handler.bg.io.errro.count COUNT : 0
rocksdb.error.handler.bg.retryable.io.errro.count COUNT : 0
rocksdb.error.handler.autoresume.count COUNT : 0
rocksdb.error.handler.autoresume.retry.total.count COUNT : 0
rocksdb.error.handler.autoresume.success.count COUNT : 0
rocksdb.db.get.micros P50 : 135.441127 P95 : 261.215601 P99 : 445.946130 P100 : 2186877.000000 COUNT : 7157134 SUM : 1866465813
rocksdb.db.write.micros P50 : 14.167865 P95 : 26.136511 P99 : 36.712036 P100 : 11201663.000000 COUNT : 7141933 SUM : 450797827
rocksdb.compaction.times.micros P50 : 10607692.307692 P95 : 47800000.000000 P99 : 61117815.000000 P100 : 61117815.000000 COUNT : 83 SUM : 1122085952
rocksdb.compaction.times.cpu_micros P50 : 975000.000000 P95 : 6335000.000000 P99 : 12546875.000000 P100 : 12546875.000000 COUNT : 83 SUM : 139187500
rocksdb.subcompaction.setup.times.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.table.sync.micros P50 : 1550000.000000 P95 : 14266666.666667 P99 : 19182171.000000 P100 : 19182171.000000 COUNT : 58 SUM : 248024074
rocksdb.compaction.outfile.sync.micros P50 : 570000.000000 P95 : 10349230.769231 P99 : 19344000.000000 P100 : 46529062.000000 COUNT : 366 SUM : 844570626
rocksdb.wal.file.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.manifest.file.sync.micros P50 : 2630.769231 P95 : 143750.000000 P99 : 338833.333333 P100 : 566012.000000 COUNT : 195 SUM : 4254124
rocksdb.table.open.io.micros P50 : 225.627907 P95 : 542.833333 P99 : 1108.220000 P100 : 1834.000000 COUNT : 423 SUM : 112931
rocksdb.db.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.block.compaction.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.block.get.micros P50 : 12.141841 P95 : 29.235488 P99 : 45.943366 P100 : 1769619.000000 COUNT : 56297395 SUM : 1794923100
rocksdb.write.raw.block.micros P50 : 0.554366 P95 : 1.533811 P99 : 1.978022 P100 : 456567.000000 COUNT : 8398137 SUM : 28791339
rocksdb.l0.slowdown.count P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.memtable.compaction.count P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.files.stall.count P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.hard.rate.limit.delay.count P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.soft.rate.limit.delay.count P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.numfiles.in.singlecompaction P50 : 1.000000 P95 : 3.535714 P99 : 5.700000 P100 : 7.000000 COUNT : 145 SUM : 202
rocksdb.db.seek.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.write.stall P50 : 6133333.333333 P95 : 11198458.000000 P99 : 11198458.000000 P100 : 11198458.000000 COUNT : 15 SUM : 89958918
rocksdb.sst.read.micros P50 : 8.752933 P95 : 25.213533 P99 : 42.617881 P100 : 1769614.000000 COUNT : 56332176 SUM : 1641806935
rocksdb.num.subcompactions.scheduled P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.bytes.per.read P50 : 0.501791 P95 : 0.953402 P99 : 0.993545 P100 : 1024.000000 COUNT : 7157228 SUM : 26070016
rocksdb.bytes.per.write P50 : 1092.833365 P95 : 1293.383394 P99 : 2686.169237 P100 : 4156.000000 COUNT : 6893801 SUM : 7498409468
rocksdb.bytes.per.multiget P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.bytes.compressed P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.bytes.decompressed P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.compression.times.nanos P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.decompression.times.nanos P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.num.merge_operands P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.key.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.value.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.write.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.get.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.seek.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.next.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.prev.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.write.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.read.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.gc.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.compression.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.decompression.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.flush.micros P50 : 1744444.444444 P95 : 17360000.000000 P99 : 19424294.000000 P100 : 19424294.000000 COUNT : 58 SUM : 260332025
rocksdb.sst.batch.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.index.and.filter.blocks.read.per.level P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.data.blocks.read.per.level P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.sst.read.per.level P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.error.handler.autoresume.retry.count P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0